sanjuchopracool/llvm/lib/Target/STM8/STM8ISelLowering.h
//===-- STM8ISelLowering.h - STM8 DAG Lowering Interface ----*- C++ -*-===//
//
//                     The LLVM Compiler Infrastructure
//
// This file is distributed under the University of Illinois Open Source
// License. See LICENSE.TXT for details.
//
//===----------------------------------------------------------------------===//
//
// This file defines the interfaces that STM8 uses to lower LLVM code into a
// selection DAG.
//
//===----------------------------------------------------------------------===//

#ifndef LLVM_LIB_TARGET_STM8_STM8ISELLOWERING_H
#define LLVM_LIB_TARGET_STM8_STM8ISELLOWERING_H

#include "STM8.h"
#include "llvm/CodeGen/SelectionDAG.h"
#include "llvm/Target/TargetLowering.h"

namespace llvm {
  namespace STM8ISD {
    enum NodeType : unsigned {
      FIRST_NUMBER = ISD::BUILTIN_OP_END,

      /// Return with a flag operand. Operand 0 is the chain operand.
      RET_FLAG,
    };
  }

  class STM8Subtarget;
  class STM8TargetLowering : public TargetLowering {
  public:
    explicit STM8TargetLowering(const TargetMachine &TM,
                                  const STM8Subtarget &STI);

  private:

      /// getTargetNodeName - This method returns the name of a target specific
      /// DAG node.
      const char *getTargetNodeName(unsigned Opcode) const override;

    SDValue
    LowerFormalArguments(SDValue Chain, CallingConv::ID CallConv, bool isVarArg,
                         const SmallVectorImpl<ISD::InputArg> &Ins,
                         const SDLoc &dl, SelectionDAG &DAG,
                         SmallVectorImpl<SDValue> &InVals) const override;

    SDValue LowerReturn(SDValue Chain, CallingConv::ID CallConv, bool isVarArg,
                        const SmallVectorImpl<ISD::OutputArg> &Outs,
                        const SmallVectorImpl<SDValue> &OutVals,
                        const SDLoc &dl, SelectionDAG &DAG) const override;

  };
} // namespace llvm

#endif
